Meekdai/STM32-GRBL/user/cnc/stepper.c
/*
  stepper.c - stepper motor driver: executes motion plans using stepper motors
  Part of Grbl

  The MIT License (MIT)

  GRBL(tm) - Embedded CNC g-code interpreter and motion-controller
  Copyright (c) 2009-2011 Simen Svale Skogsrud
  Copyright (c) 2011-2012 Sungeun K. Jeon

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in
  all copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
  THE SOFTWARE.
*/

#include "stm32f10x.h"
//#include <avr/interrupt.h>
#include "stepper.h"
#include "config.h"
#include "settings.h"
#include "planner.h"
#include "stepper.h"
#include "delay.h"
#include "gpio.h"

#define F_CPU 74000000L

// Some useful constants
#define TICKS_PER_MICROSECOND (F_CPU/1000000)
#define CYCLES_PER_ACCELERATION_TICK ((TICKS_PER_MICROSECOND*1000000)/ACCELERATION_TICKS_PER_SECOND)

volatile char Emergency = 0;
char ShowPos = 0;

// Stepper state variable. Contains running data and trapezoid variables.
typedef struct {
  // Used by the bresenham line algorithm
  int32_t counter_x,        // Counter variables for the bresenham line tracer
          counter_y, 
          counter_z;
  uint32_t event_count;
  uint32_t step_events_completed;  // The number of step events left in current motion

  // Used by the trapezoid generator
  uint32_t cycles_per_step_event;        // The number of machine cycles between each step event
  uint32_t trapezoid_tick_cycle_counter; // The cycles since last trapezoid_tick. Used to generate ticks at a steady
                                              // pace without allocating a separate timer
  uint32_t trapezoid_adjusted_rate;      // The current rate of step_events according to the trapezoid generator
  uint32_t min_safe_rate;  // Minimum safe rate for full deceleration rate reduction step. Otherwise halves step_rate.
} stepper_t;

static stepper_t st;
static block_t *current_block;  // A pointer to the block currently being traced

// Used by the stepper driver interrupt
//static uint8_t step_pulse_time; // Step pulse reset time after step rise
static uint8_t out_bits;        // The next stepping-bits to be output
static volatile uint8_t busy;   // True when SIG_OUTPUT_COMPARE1A is being serviced. Used to avoid retriggering that handler.

#if STEP_PULSE_DELAY > 0
  static uint8_t step_bits;  // Stores out_bits output to complete the step pulse delay
#endif

//         __________________________
//        /|                        |\     _________________         ^
//       / |                        | \   /|               |\        |
//      /  |                        |  \ / |               | \       s
//     /   |                        |   |  |               |  \      p
//    /    |                        |   |  |               |   \     e
//   +-----+------------------------+---+--+---------------+----+    e
//   |               BLOCK 1            |      BLOCK 2          |    d
//
//                           time ----->
// 
//  The trapezoid is the shape the speed curve over time. It starts at block->initial_rate, accelerates by block->rate_delta
//  during the first block->accelerate_until step_events_completed, then keeps going at constant speed until 
//  step_events_completed reaches block->decelerate_after after which it decelerates until the trapezoid generator is reset.
//  The slope of acceleration is always +/- block->rate_delta and is applied at a constant rate following the midpoint rule
//  by the trapezoid generator, which is called ACCELERATION_TICKS_PER_SECOND times per second.

static void set_step_events_per_minute(uint32_t steps_per_minute);

// Stepper state initialization. Cycle should only start if the st.cycle_start flag is
// enabled. Startup init and limits call this function but shouldn't start the cycle.
//void st_wake_up() 
//{
//  // Enable steppers by resetting the stepper disable port
//  if (bit_istrue(settings.flags,BITFLAG_INVERT_ST_ENABLE)) { 
//    STEPPERS_DISABLE_PORT |= (1<<STEPPERS_DISABLE_BIT); 
//  } else { 
//    STEPPERS_DISABLE_PORT &= ~(1<<STEPPERS_DISABLE_BIT);
//  }
//  if (sys.state == STATE_CYCLE) {
//    // Initialize stepper output bits
//    out_bits = (0) ^ (settings.invert_mask); 
//    // Initialize step pulse timing from settings. Here to ensure updating after re-writing.
//    #ifdef STEP_PULSE_DELAY
//      // Set total step pulse time after direction pin set. Ad hoc computation from oscilloscope.
//      step_pulse_time = -(((settings.pulse_microseconds+STEP_PULSE_DELAY-2)*TICKS_PER_MICROSECOND) >> 3);
//      // Set delay between direction pin write and step command.
//      OCR2A = -(((settings.pulse_microseconds)*TICKS_PER_MICROSECOND) >> 3);
//    #else // Normal operation
//      // Set step pulse time. Ad hoc computation from oscilloscope. Uses two's complement.
//      step_pulse_time = -(((settings.pulse_microseconds-2)*TICKS_PER_MICROSECOND) >> 3);
//    #endif
//    // Enable stepper driver interrupt
//    TIMSK1 |= (1<<OCIE1A);
//  }
//}

void Motors_Set_GPIO()
{
	PA0_OUT //	PB1 OUT - Step
	PA1_OUT //	PE7 OUT - Dir
	PA2_OUT //	PE9 OUT - Enable
	
	PA3_OUT //	PE11 OUT - Step
	PA4_OUT //	PE13 OUT - Dir
	PA5_OUT //	PE15 OUT - Enable
	
	Set_A0
	Set_A1
	Set_A2
	
	Set_A3
	Set_A4
	Set_A5
}

void MotorsEnable(char motors)
	{
		if(motors & (1 << 0)){MOTOR1_DISABLE;}
		else {MOTOR1_ENABLE;}
		if(motors & (1 << 1)){MOTOR2_DISABLE;}
		else {MOTOR2_ENABLE;}
		if(motors & (1 << 2)){MOTOR3_ENABLE;}
		else {MOTOR3_DISABLE;}
		//delay_us(5);
}

void enable_emergency(void)
{
		GPIOE->CRL &= ~0x000F0000;
		GPIOE->CRL |= 0x00080000; //	input
		GPIOE->BSRR |= (1 << 4);	//	Pull up
}

void st_wake_up() 
{
  // Enable steppers by resetting the stepper disable port
	//MotorsEnable(0x07);
  if (sys.state == STATE_CYCLE) {
    // Initialize stepper output bits
    out_bits = (0) ^ (settings.invert_mask); 
    // Initialize step pulse timing from settings. Here to ensure updating after re-writing.
      // Set step pulse time. Ad hoc computation from oscilloscope. Uses two's complement.
//    step_pulse_time = -(((settings.pulse_microseconds-2)*TICKS_PER_MICROSECOND) >> 3);
    // Enable stepper driver interrupt
    NVIC_EnableIRQ (TIM2_IRQn);  
		NVIC_SetPriority(TIM2_IRQn, 1);
		enable_emergency();
		Emergency = 1;	//	KLasicka praca
		ShowPos = 1;
  }
}

// Stepper shutdown
//void st_go_idle() 
//{
//  // Disable stepper driver interrupt
//  TIMSK1 &= ~(1<<OCIE1A); 
//  // Disable steppers only upon system alarm activated or by user setting to not be kept enabled.
//  if ((settings.stepper_idle_lock_time != 0xff) || bit_istrue(sys.execute,EXEC_ALARM)) {
//    // Force stepper dwell to lock axes for a defined amount of time to ensure the axes come to a complete
//    // stop and not drift from residual inertial forces at the end of the last movement.
//    delay_ms(settings.stepper_idle_lock_time);
//    if (bit_istrue(settings.flags,BITFLAG_INVERT_ST_ENABLE)) { 
//      STEPPERS_DISABLE_PORT &= ~(1<<STEPPERS_DISABLE_BIT); 
//    } else { 
//      STEPPERS_DISABLE_PORT |= (1<<STEPPERS_DISABLE_BIT); 
//    }   
//  }
//}

// Stepper shutdown
void st_go_idle() 
{
  // Disable stepper driver interrupt
//	printpos_grbl(0,480);
	ShowPos = 0;
  NVIC_DisableIRQ (TIM2_IRQn); 
  NVIC_DisableIRQ (EXTI4_IRQn); 

