Meekdai/STM32-GRBL/user/cnc/stepper.c
// This interrupt is set up by ISR_TIMER1_COMPAREA when it sets the motor port bits. It resets
// the motor port after a short period (settings.pulse_microseconds) completing one step cycle.
// NOTE: Interrupt collisions between the serial and stepper interrupts can cause delays by
// a few microseconds, if they execute right before one another. Not a big deal, but can
// cause issues at high step rates if another high frequency asynchronous interrupt is 
// added to Grbl.
//ISR(TIMER2_OVF_vect)
//{
//  // Reset stepping pins (leave the direction pins)
//  STEPPING_PORT = (STEPPING_PORT & ~STEP_MASK) | (settings.invert_mask & STEP_MASK); 
//  TCCR2B = 0; // Disable Timer2 to prevent re-entering this interrupt when it's not needed. 
//}

/*
void TIM4_IRQHandler(void)
{
  if ((TIM4->SR & 0x0001) != 0)                  // check interrupt source
	{
		TIM4->CR1 &= ~(1<<0);                      // Disable Timer
    TIM4->SR &= ~(1<<0);                          // clear UIF flag
		// Reset stepping pins (leave the direction pins)
		DoOutPort(0x00,0x02);	//	na piny poslem pohyb
	}
} 
*/

#ifdef STEP_PULSE_DELAY
  // This interrupt is used only when STEP_PULSE_DELAY is enabled. Here, the step pulse is
  // initiated after the STEP_PULSE_DELAY time period has elapsed. The ISR TIMER2_OVF interrupt
  // will then trigger after the appropriate settings.pulse_microseconds, as in normal operation.
  // The new timing between direction, step pulse, and step complete events are setup in the
  // st_wake_up() routine.
  ISR(TIMER2_COMPA_vect) 
  { 
    STEPPING_PORT = step_bits; // Begin step pulse.
  }
#endif

// Reset and clear stepper subsystem variables
void st_reset()
{
  memset(&st, 0, sizeof(st));
  set_step_events_per_minute(MINIMUM_STEPS_PER_MINUTE);
  current_block = NULL;
  busy = false;
}

// Initialize and start the stepper motor subsystem
void st_init()
{
//  // Configure directions of interface pins
//  STEPPING_DDR |= STEPPING_MASK;
//  STEPPING_PORT = (STEPPING_PORT & ~STEPPING_MASK) | settings.invert_mask;
//  STEPPERS_DISABLE_DDR |= 1<<STEPPERS_DISABLE_BIT;

//  // waveform generation = 0100 = CTC
//  TCCR1B &= ~(1<<WGM13);
//  TCCR1B |=  (1<<WGM12);
//  TCCR1A &= ~(1<<WGM11); 
//  TCCR1A &= ~(1<<WGM10);

//  // output mode = 00 (disconnected)
//  TCCR1A &= ~(3<<COM1A0); 
//  TCCR1A &= ~(3<<COM1B0); 
//	
//  // Configure Timer 2
//  TCCR2A = 0; // Normal operation
//  TCCR2B = 0; // Disable timer until needed.
//  TIMSK2 |= (1<<TOIE2); // Enable Timer2 Overflow interrupt     
//  #ifdef STEP_PULSE_DELAY
//    TIMSK2 |= (1<<OCIE2A); // Enable Timer2 Compare Match A interrupt
//  #endif

//  // Start in the idle state, but first wake up to check for keep steppers enabled option.
//  st_wake_up();
//  st_go_idle();

//    RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;                     // enable clock for TIM2

//		TIM2->PSC = 0;                            // set prescaler
//		TIM2->ARR = 1000;												  // set auto-reload
//		TIM2->CR1 = 0;                            // reset command register 1
//		TIM2->CR2 = 0;                            // reset command register 2
//		TIM2->DIER = (1<<0);                      // Update interrupt enabled
//		TIM2->CR1 |= (1<<0);                      // Enable Timer

		DoOutPort(0,0x03);
		

		st_wake_up();
		st_go_idle();
		
}

// Configures the prescaler and ceiling of timer 1 to produce the given rate as accurately as possible.
// Returns the actual number of cycles per interrupt
static uint32_t config_step_timer(uint32_t cycles)
{
  uint16_t ceiling;
  uint8_t prescaler;
  uint32_t actual_cycles;
  if (cycles <= 0xffffL) {
    ceiling = cycles;
    prescaler = 1; // prescaler: 0
    actual_cycles = ceiling;
  } else if (cycles <= 0x7ffffL) {
    ceiling = cycles >> 3;
    prescaler = 2; // prescaler: 8
    actual_cycles = ceiling * 8L;
  } else if (cycles <= 0x3fffffL) {
    ceiling =  cycles >> 6;
    prescaler = 3; // prescaler: 64
    actual_cycles = ceiling * 64L;
  } else if (cycles <= 0xffffffL) {
    ceiling =  (cycles >> 8);
    prescaler = 4; // prescaler: 256
    actual_cycles = ceiling * 256L;
  } else if (cycles <= 0x3ffffffL) {
    ceiling = (cycles >> 10);
    prescaler = 5; // prescaler: 1024
    actual_cycles = ceiling * 1024L;    
  } else {
    // Okay, that was slower than we actually go. Just set the slowest speed
    ceiling = 0xffff;
    prescaler = 5;
    actual_cycles = 0xffff * 1024;
  }
//  // Set prescaler
//  TCCR1B = (TCCR1B & ~(0x07<<CS10)) | (prescaler<<CS10);
//  // Set ceiling
//  OCR1A = ceiling;
	
	TIM2->PSC = prescaler;                      // set prescaler
	TIM2->ARR = ceiling;											  // set auto-reload
  return(actual_cycles);
}

static void set_step_events_per_minute(uint32_t steps_per_minute) 
{
  if (steps_per_minute < MINIMUM_STEPS_PER_MINUTE) { steps_per_minute = MINIMUM_STEPS_PER_MINUTE; }
  st.cycles_per_step_event = config_step_timer((TICKS_PER_MICROSECOND*1000000*60)/steps_per_minute);
}

// Planner external interface to start stepper interrupt and execute the blocks in queue. Called
// by the main program functions: planner auto-start and run-time command execution.
void st_cycle_start() 
{
  if (sys.state == STATE_QUEUED) {
    sys.state = STATE_CYCLE;
    st_wake_up();
  }
}

// Execute a feed hold with deceleration, only during cycle. Called by main program.
void st_feed_hold() 
{
  if (sys.state == STATE_CYCLE) {
    sys.state = STATE_HOLD;
    sys.auto_start = false; // Disable planner auto start upon feed hold.
  }
}

// Reinitializes the cycle plan and stepper system after a feed hold for a resume. Called by 
// runtime command execution in the main program, ensuring that the planner re-plans safely.
// NOTE: Bresenham algorithm variables are still maintained through both the planner and stepper
// cycle reinitializations. The stepper path should continue exactly as if nothing has happened.
// Only the planner de/ac-celerations profiles and stepper rates have been updated.
void st_cycle_reinitialize()
{
  if (current_block != NULL) {
    // Replan buffer from the feed hold stop location.
    plan_cycle_reinitialize(current_block->step_event_count - st.step_events_completed);
    // Update initial rate and timers after feed hold.
    st.trapezoid_adjusted_rate = 0; // Resumes from rest
    set_step_events_per_minute(st.trapezoid_adjusted_rate);
    st.trapezoid_tick_cycle_counter = CYCLES_PER_ACCELERATION_TICK/2; // Start halfway for midpoint rule.
    st.step_events_completed = 0;
    sys.state = STATE_QUEUED;
  } else {
    sys.state = STATE_IDLE;
  }
}



